package robot

const (
	MsgTypeText           = 1     // 文本消息
	MsgTypeImage          = 3     // 图片消息
	MsgTypeVoice          = 34    // 语音消息
	MsgTypeAuthentication = 37    // 认证消息
	MsgTypePossibleFriend = 40    // 好友推荐消息
	MsgTypeShareCard      = 42    // 名片消息
	MsgTypeVideo          = 43    // 视频消息
	MsgTypeMemePicture    = 47    // 表情消息
	MsgTypeLocation       = 48    // 地理位置消息
	MsgTypeApp            = 49    // APP消息
	MsgTypeMicroVideo     = 62    // 小视频消息
	MsgTypeSystem         = 10000 // 系统消息
	MsgTypeRecalled       = 10002 // 消息撤回
	MsgTypeReference      = 10003 // 消息引用
)

// EmojiSymbol 表情符号
var EmojiSymbol = []string{"[憨笑]", "[敲打]", "[胜利]", "[怄火]", "[旺柴]", "[裂开]", "[苦涩]", "[难过]", "[偷笑]", "[抱拳]", "[吃瓜]", "[打脸]", "[666]", "[尴尬]", "[调皮]", "[坏笑]", "[咖啡]", "[加油]", "[破涕为笑]", "[脸红]", "[庆祝]", "[得意]", "[咒骂]", "[奸笑]", "[机智]", "[福]", "[嘴唇]", "[刀]", "[发怒]", "[饥饿]", "[乱舞]", "[右太极]", "[嘿哈]", "[加油加油]", "[惊讶]", "[玫瑰]", "[投降]", "[红包]", "[爱你]", "[发抖]", "[回头]", "[冷汗]", "[闪电]", "[足球]", "[勾引]", "[OK]", "[转圈]", "[Emm]", "[好的]", "[吐]", "[傲慢]", "[吓]", "[西瓜]", "[篮球]", "[便便]", "[大哭]", "[呲牙]", "[疯了]", "[委屈]", "[跳跳]", "[皱眉]", "[让我看看]", "[笑脸]", "[愉快]", "[乒乓]", "[猪头]", "[發]", "[恐惧]", "[酷]", "[惊恐]", "[擦汗]", "[哈欠]", "[菜刀]", "[跳绳]", "[闭嘴]", "[白眼]", "[鼓掌]", "[亲亲]", "[激动]", "[流泪]", "[衰]", "[糗大了]", "[太阳]", "[失望]", "[囧]", "[阴险]", "[礼物]", "[凋谢]", "[磕头]", "[蛋糕]", "[生病]", "[发呆]", "[鄙视]", "[快哭了]", "[啤酒]", "[撇嘴]", "[流汗]", "[捂脸]", "[天啊]", "[翻白眼]", "[抓狂]", "[拳头]", "[合十]", "[爆竹]", "[爱心]", "[心碎]", "[左太极]", "[耶]", "[蜡烛]", "[社会社会]", "[睡]", "[悠闲]", "[疑问]", "[弱]", "[爱情]", "[烟花]", "[晕]", "[再见]", "[可怜]", "[炸弹]", "[差劲]", "[献吻]", "[鸡]", "[哇]", "[抠鼻]", "[握手]", "[NO]", "[困]", "[奋斗]", "[汗]", "[无语]", "[害羞]", "[左哼哼]", "[右哼哼]", "[强]", "[茶]", "[叹气]", "[色]", "[月亮]", "[飞吻]", "[微笑]", "[嘘]", "[骷髅]", "[饭]", "[瓢虫]", "[拥抱]"}
